[TownTree.cA_Fortress_VillageHall H7TownHall]
mName="村镇大厅"
mDesc="提供在此城镇建造新建筑的选项。\n每天提供500 %ICON_GOLD 黄金。"

[TownTree.cA_Fortress_TownHall H7TownHall]
mName="城镇大厅"
mDesc="每天额外提供500 %ICON_GOLD 黄金。"

[TownTree.cA_Fortress_CityHall H7TownHall]
mName="城市大厅"
mDesc="每天额外提供1000 %ICON_GOLD 黄金。"

[TownTree.cA_Fortress_Capitol H7TownHall]
mName="国会"
mDesc="每天额外提供2000 %ICON_GOLD 黄金。你只能拥有一个首都。"

[TownTree.cA_Fortress_Fortifications_Level1 H7TownGuardBuilding]
mName="防御工事-等级1"
mDesc="为城市提供城墙和城门\n生产守备部队，直至达到守备上限"

[TownTree.cA_Fortress_Fortifications_Level2 H7TownGuardBuilding]
mName="防御工事-等级2"
mDesc="加固城堡的城墙和城门\n增加最大守备部队规模\n增加周产量"

[TownTree.cA_Fortress_Fortifications_Level3 H7TownGuardBuilding]
mName="防御工事-等级3"
mDesc="加固城堡的城墙和城门\n显著增加最大守备部队规模\n减少周产量"

[TownTree.cA_Fortress_Foundry H7TownTower]
mName="瞭望塔"
mDesc="在攻城战中为城镇提供2座箭塔。\n为防御方军队中的单位增加+10 %ICON_ATTACK 攻击和+15 %ICON_DEFENSE 防御。"

[TownTree.cA_Fortress_MagicGuild_Level1 H7TownMagicGuild]
mName="魔法行会-等级1"
mDesc="在此城镇提供7个随机的1阶法术。\n它们会授予所有满足条件的到访英雄。"

[TownTree.cA_Fortress_MagicGuild_Level2 H7TownMagicGuild]
mName="魔法行会-等级2"
mDesc="在此城镇提供6个随机的2阶法术。\n它们会授予所有满足条件的到访英雄。"

[TownTree.cA_Fortress_MagicGuild_Level3 H7TownMagicGuild]
mName="魔法行会-等级3"
mDesc="在此城镇提供4个随机的3阶法术。\n它们会授予所有满足条件的到访英雄。"

[TownTree.cA_Fortress_MagicGuild_Level4 H7TownMagicGuild]
mName="魔法行会-等级4"
mDesc="在此城镇提供2个随机的4阶法术。\n它们会授予所有满足条件的到访英雄。"

[TownTree.cA_Fortress_HallOfHeroes H7TownBuilding]
mName="英雄大殿"
mDesc="允许雇佣英雄，包括新英雄和已被击败的英雄。新英雄的选择会在每周开始时更换。"

[TownTree.cA_Fortress_ShieldBarracks H7TownDwelling]
mName="山脊驻军"
mDesc="核心生物住所。\n允许招募铁脊怪，周产量为20。"

[TownTree.cA_Fortress_ShieldHalls H7TownDwelling]
mName="巨脊驻军"
mDesc="核心生物升级住所。\n允许招募并将铁脊怪升级为钢脊怪。\n(基础增长：20/周)"

[TownTree.cA_Fortress_Workshop H7TownGrowthEnhancer]
mName="营地"
mDesc="核心生物住所升级。\n每周+8铁脊怪或钢脊怪。"

[TownTree.cA_Fortress_KoboldBurrows H7TownDwelling]
mName="沉思圣殿"
mDesc="核心生物住所。\n允许招募图腾怪，周产量为15。"

[TownTree.cA_Fortress_KoboldWarrens H7TownDwelling]
mName="崇拜圣殿"
mDesc="核心生物升级住所。\n允许招募并将图腾怪升级为偶像者。\n(基础增长：15/周)"

[TownTree.cA_Fortress_Granary H7TownGrowthEnhancer]
mName="沼泽圣殿"
mDesc="核心生物住所升级。\n每周+8图腾怪或偶像者。"

[TownTree.cA_Fortress_BearPens H7TownDwelling]
mName="黑暗洞穴"
mDesc="核心生物住所。\n允许招募蜻蜓，周产量为12。"

[TownTree.cA_Fortress_BlackbearCages H7TownDwelling]
mName="余烬洞穴"
mDesc="核心生物升级住所。\n允许招募并将蜻蜓升级为龙蛇。\n(基础增长：12/周)"

[TownTree.cA_Fortress_FishingPond H7TownGrowthEnhancer]
mName="蜂巢"
mDesc="核心生物住所升级。\n每周+6蜻蜓或龙蛇。"

[TownTree.cA_Fortress_LavaConflux H7TownDwelling]
mName="穴居龙之芽"
mDesc="精英生物住所。\n允许招募穴居龙，周产量为6。"

[TownTree.cA_Fortress_MagmaConflux H7TownDwelling]
mName="原始之花"
mDesc="精英生物升级住所。\n允许招募并将穴居龙升级为远古穴居龙。\n(基础增长：6/周)"

[TownTree.cA_Fortress_VolcanicChimney H7TownGrowthEnhancer]
mName="原始之芽"
mDesc="精英生物住所升级。\n每周+6穴居龙或远古穴居龙。"

[TownTree.cA_Fortress_DisBonfire H7TownDwelling]
mName="雨林"
mDesc="精英生物住所。\n允许招募蜥蜴人，周产量为7。"

[TownTree.cA_Fortress_ValkyrieBonfire H7TownDwelling]
mName="棕榈森林"
mDesc="精英生物升级住所。\n允许招募并将蜥蜴人升级为蜥蜴人战士。\n(基础增长：7/周)"

[TownTree.cA_Fortress_BlazingMaiden H7TownGrowthEnhancer]
mName="丰饶之林"
mDesc="精英生物住所升级。\n每周+7蜥蜴人或蜥蜴人战士。"

[TownTree.cA_Fortress_RunicChapel H7TownDwelling]
mName="圣殿"
mDesc="精英生物住所。\n允许招募鳄蜥，周产量为2。"

[TownTree.cA_Fortress_RunicTemple H7TownDwelling]
mName="神圣圣殿"
mDesc="精英生物升级住所。\n允许招募并将鳄蜥升级为神圣鳄蜥。\n(基础增长：2/周)"

[TownTree.cA_Fortress_FlamingPillar H7TownGrowthEnhancer]
mName="伊拉斯圣殿"
mDesc="精英生物住所升级。\n每周+2鳄蜥或神圣鳄蜥。"

[TownTree.cA_Fortress_HearthOfGiants H7TownDwelling]
mName="暴龙漫步场"
mDesc="冠军生物住所。\n允许招募暴龙，周产量为2。"

[TownTree.cA_Fortress_HearthOfEinherjars H7TownDwelling]
mName="暴龙觅食场"
mDesc="冠军生物升级住所。\n允许招募并将暴龙升级为覆甲暴龙。\n(基础增长：2/周)"

[TownTree.cA_Fortress_CradleOfFire H7TownDwelling]
mName="山巅巢穴"
mDesc="冠军生物住所。\n允许招募翼手龙，周产量为2。"

[TownTree.cA_Fortress_MountainOfFire H7TownDwelling]
mName="神圣巢穴"
mDesc="冠军生物升级住所。\n允许招募并将翼手龙升级为狂怒翼手龙。\n(基础增长：2/周)"

[Build_extra.A_citadel_chambre_de_hydre H7TownDwelling]
mName="半人马洞穴"
mDesc="精英生物住所。\n允许招募半人蜥蜴。\n可以使用“招募所有”功能进行招募。\n(基础增长：4/周)"

[Build_extra.A_citadel_cahmbre_elite H7TownDwelling]
mName="九头蛇林间空地"
mDesc="冠军生物住所。\n允许招募爬行九头蛇。\n可以使用“招募所有”功能进行招募。\n(基础增长：1/周)"

[TownTree.cA_Fortress_Armory H7TownUtilityUnitDwelling]
mName="死藤水"
mDesc="战争单位生产建筑。\n提供购买萨满弩车的可能性。"

[TownTree.cA_Fortress_RuneDesigner H7TownUtilityUnitDwelling]
mName="工坊"
mDesc="战争单位生产建筑。\n提供购买符文石的可能性。"

[TownTree2.cA_Fortress_RunicFortifications H7TownBuilding]
mName="茂密丛林"
mDesc="敌方英雄在陆地上的移动速度减慢20%，并且所有敌方生物的%icon_Moral 士气和%icon_max_movement 移动力在此城市的控制区域内下降。"

[TownTree2.cA_Fortress_RuneDesigner H7TownBuilding]
mName="气候增幅器"
mDesc="你的英雄在此城镇控制区域内施放的气系和土系法术会提升一阶施放。"

[TownTree2.cA_Fortress_ExchequerOffice H7TownBuilding]
mName="防护图腾"
mDesc="友方生物在战斗的前3回合中获得最终伤害20%的加成。"

[TownTree.cA_Fortress_TownPortal H7TownPortal]
mName="城镇传送门"
mDesc="为所有到访此城镇的英雄提供法术‘即时召回’。\n使拥有此法术的英雄可以返回此城镇，如果这是最近的可用城镇。"

[TownTree.cA_Fortress_ThievesGuild H7TownThiefGuild]
mName="盗贼公会"
mDesc="提供支付黄金获取对手信息的选项。"

[TownTree.cA_Fortress_ShrineOfArkath H7TownBuilding]
mName="丛林恩赐"
mDesc="每天提供1 %icon_Ore 矿石和1 %icon_Wood 木材。"

[TownTree.cA_Fortress_SacredFire H7TownBuilding]
mName="神圣之风"
mDesc="到访英雄在接下来的3场战斗中获得+2 %icon_might 力量和+5 %icon_leadership 领导力。"

[TownTree.cA_Fortress_RuneAtelier H7TownSiloBuilding]
mName="丰产文化"
mDesc="每天随机提供1 %icon_Crystal Dragon Blood 龙血水晶、%icon_Dragonsteel 龙钢、%icon_Shadowsteel 影钢或%icon_Starsilver 星银。"

[TownTree.cA_Fortress_Marketplace H7TownMarketplace]
mName="市场"
mDesc="提供交易资源的选项。"

[TownTree.cA_Fortress_Embassy H7TownEmbassy]
mName="战斧"
mDesc="你的英雄在此城市的控制区域内与中立军队谈判的成功率增加15%。"

[TownTree.cA_Fortress_ArkathsEternalFlame H7TownTearOfAsha]
mName="阿尔卡斯的永恒之火"
mDesc="每天提供5000 %ICON_GOLD 黄金，并在此城市中使生物周产量提高50%。建造完成时提供特殊道具、四个主要宝物和四个圣器宝物。"

[TownTree.cA_Fortress_ShrineOfArkath_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName=""
mTooltip=""

[TownTree.cA_Fortress_SacredFire_Buff_Hero H7BaseBuff]
mName="神圣之风"
mTooltip="%stat1 %icon_attack 攻击和%stat2 %icon_moral 领导力，持续接下来的%durnow场战斗。"

[TownTree.cA_Fortress_SacredFire_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName=""
mTooltip=""

[TownTree.cA_Fortress_ArkathsEternalFlame_TownBuff H7BaseBuff]
mName="阿尔卡斯的永恒之火"
mTooltip=""

[TownTree.cA_Fortress_ArkathsEternalFlame_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName=""
mTooltip=""

[town_name.H7citadel_TownNames H7GenericTownNames]
mTownNames[0]="约卡奇"
mTownNames[1]="戈克萨维特尔"
mTownNames[2]="亨特利克斯"
mTownNames[3]="萨赫奇钦"
mTownNames[4]="伊克纳克纳"
mTownNames[5]="安特洛克斯坦"
mTownNames[6]="楚阿拉克-克里"
mTownNames[7]="克罗克拉特·弗尔斯科里姆"
mTownNames[8]="诺特阿-科阿"
mTownNames[9]="克罗尔-卡莫埃普"
mTownNames[10]="齐普-特卢哈尔"

[town_name.A_citadel_Town_Lv1_Name H7GlobalName]
mName="堡垒圣殿"

[TownTree.cA_Fortress_Embassy_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName=""
mTooltip=""

[TownTree2.cA_totem_Buff_creature2 H7BaseBuff]
mName="原始图腾"
mTooltip="生物的伤害提高%stat1，持续%durnow回合。"

[TownTree2.totem_Buff_Hero2 H7BaseBuff]
mName="原始图腾"
mTooltip="在战斗的前%buff1.buff.durini回合内，友方生物的最终伤害提高%buff1.buff.stat1。"

[Faction.A_Lore_FactionTemple H7GeneralLoreEntry]
mName="神庙"
mText="亚莎按照自己的形象创造了蜥蜴人，\n他们是冷血生物，也是亚山最古老的文明之一。在神话时代天使与无面者的第一次冲突期间，他们自我放逐到了雨林之地，在亚莎的庇护下，亚莎在他们的国度周围创造了一场永恒风暴，保护边界免受一切外来入侵。\n随着第一次月食，恶魔从乌尔加斯的监狱中被释放出来，亚莎魔法的最后光辉逐渐消失，永恒风暴终结，蜥蜴人国度的火山随之苏醒……蜥蜴人被迫流亡，逃往亚山东部自由城邦的王国避难，伊拉斯是其中令人敬仰的一个，他们感到与之有着紧密的联系……"

[Town.A_CitadelTownLv1 H7Town]
mName=""

[TownTree2.cA_Fortress_SacredFire_Buff_Hero2 H7BaseBuff]
mName="沼泽之灵"
mTooltip="永久+2 %icon_magic 魔力、+2 %icon_attack 攻击、+2 %icon_defense 防御。\n%stat1 %icon_attack 攻击和%stat2 %icon_morale 领导力，持续接下来的%durnow场战斗。"

[TownTree2.cA_Fortress_SacredFire_Ability2 H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName=""
mTooltip=""

[TownTree2.A_NecropolisMoonlightAmplifier_HeroBuff H7BaseBuff]
mName="气候增幅器"
mDesc="你的英雄在此城镇控制区域内施放的气系和土系法术会提升一阶施放。"

[TownTree2.A_NecropolisMoonlightAmplifier_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName=""
mTooltip=""

[TownTree2.A_NecropolisAshasHourglass_BuffHero H7BaseBuff]
mName="茂密丛林"
mTooltip="英雄在陆地上的移动速度减慢20%，并且英雄军队中的所有生物在当前控制区域内获得%buff1.buff.stat1和%buff1.buff.stat2。"

[TownTree2.A_NecropolisAshasHourglass_BuffCreature H7BaseBuff]
mName="茂密丛林"
mTooltip="在当前控制区域内，%stat1 %stat1.icon 领导力和%stat2 %stat2.icon 移动力。"

[TownTree2.A_NecropolisAshasHourglass_BuffAlliedHero H7BaseBuff]
mName="茂密丛林"
mTooltip=""

[TownTree2.A_NecropolisAshasHourglass_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="亚莎沙漏技能"
mTooltip=""

[Faction.H7FactionCitadel H7Faction]
mFactionName="神庙"
mFactionFortName="堡垒圣殿"
mFactionArmyName="神庙军队 %number"

v1.37

修正了箭塔描述以说明防御方增益
进行了许多修正和调整，使所有城堡的描述更加一致和正确